[
  {
    "title": "No title found",
    "content": "DOCS DOCS Home Guides Developers Integrations Changelog Sign Up mParticle is a customer data platform (CDP) that simplifies how you collect and connect your user data to hundreds of vendors without needing to manage multiple integrations. We simplify the entire process for you, so you can do more with your data without the hassle of complex integrations. New to mParticle? Explore our UI with our interactive demo. Explore Demo Get Started 1. Collect Send your first event to mParticle Go to Create an input 2. Validate Ensure data quality Go to Verify 3. Connect Forward data to a downstream services Go to Connect an event output Do more with mParticle Identity Manage user identities with IDSync Data Master View and enforce your data quality Audiences Engage customer cohorts Custom Rules Transform data as it enters and leaves mParticle User Activity View Get a complete view of your users User Privacy Ensure compliance with GDPR, CCPA, and your privacy policies Events API Send events directly to mParticle Profile API Real-time API to drive user personalization Firehose API Build your own custom integrations Inputs Client SDKs Android iOS Web View all Events API HTTP Node Python Ruby JSON Reference View all Partner Feeds Branch AppsFlyer Braze View all Custom CSV Feed Custom CSV Feed View all Outputs Events Mixpanel Amplitude Facebook Braze AppsFlyer View all Audience Facebook Snapchat Twitter Braze Pinterest View all DOCS Last Updated: 2262025, 10:31:09 PM CDP mParticle Docs Home Guides Developers Integrations Analytics Analytics Docs Overview Getting Started Developers Expert Training Predictive AI Cortex Docs Overview Getting Started Developers Using Cortex Learn More Blog Podcast Resources Community Change log Get in Touch Help Center Demo Become a Partner Â 2025 mParticle, Inc. All rights reserved. mParticle.com Privacy Policy Cookie Policy Do Not Sell or Share My Personal Data",
    "url": "https://docs.mparticle.com/"
  }
]